open-vela/nuttx/arch/arm/src/bk7258/bk7258_mb_uart.c
/****************************************************************************
 * arch/arm/src/bk7258/bk7258_mb_uart.c
 *
 * SPDX-License-Identifier: Apache-2.0
 ****************************************************************************/

/****************************************************************************
 * BK7258 full-duplex mailbox UART0.
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <assert.h>
#include <errno.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>

#include <nuttx/clock.h>
#include <nuttx/irq.h>
#include <nuttx/kthread.h>
#include <nuttx/semaphore.h>
#include <nuttx/signal.h>

#include "hardware/bk7258_mbox.h"

#ifndef CONFIG_BK7258_MB_UART0_TXBUFSIZE
#  define CONFIG_BK7258_MB_UART0_TXBUFSIZE 8192
#endif

#ifndef CONFIG_BK7258_MB_UART0_RXBUFSIZE
#  define CONFIG_BK7258_MB_UART0_RXBUFSIZE 256
#endif

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define MB_UART_TX_SIZE       CONFIG_BK7258_MB_UART0_TXBUFSIZE

/* Bounds for bk7258_mbox_uart_drain_polled().  Every loop it runs has to
 * terminate on its own, because the caller is a crash path: there is no
 * scheduler to preempt it and nothing left to recover if it spins forever.
 *
 * CHUNKS covers a whole ring at BK7258_MB_UART_CHUNK_SIZE per frame with
 * room
 * to spare.  FIFO_SPINS is generous because a full peer FIFO drains on the
 * CP's own interrupt.  SETTLE_SPINS is the gap between frames, discussed at
 * the function.
 */

#define MB_UART_POLLED_CHUNKS       64u
#define MB_UART_POLLED_FIFO_SPINS   200000u
#define MB_UART_POLLED_SETTLE_SPINS 20000u
#define MB_UART_RX_CAPACITY   CONFIG_BK7258_MB_UART0_RXBUFSIZE
#define MB_UART_RX_SIZE       (MB_UART_RX_CAPACITY + 1u)
#define MB_UART_RTS_ASSERT    BK7258_MB_UART_CHUNK_SIZE
#define MB_UART_RTS_RELEASE   ((MB_UART_RX_CAPACITY * 40u) / 100u)
#define MB_UART_WORK_INTERVAL MSEC2TICK(10)
#define MB_UART_STATUS_OVF    0x01u
#define MB_UART_STATUS_PARITY 0x02u
#define MB_UART_PRIORITY      106

struct mb_uart_stats
{
  uint32_t write_calls;
  uint32_t write_bytes;
  uint32_t short_writes;
  uint32_t data_tx;
  uint32_t data_rx;
  uint32_t state_tx;
  uint32_t state_rx;
  uint32_t rx_bytes;
  uint32_t rx_overflow;
  uint32_t bad_pointer;
  uint32_t bad_length;
  uint32_t bad_flags;
  uint32_t bad_crc;
  uint32_t bad_reserved;
  uint32_t remote_fail;
  uint32_t tx_retry;
  uint32_t tx_retry_drop;
  uint32_t tx_unknown;
  uint32_t resets;
  uint32_t rts_assert;
  uint32_t rts_release;
};

struct mb_uart_control
{
  uint8_t tx_ring[MB_UART_TX_SIZE];
  uint8_t rx_ring[MB_UART_RX_SIZE];
  uint16_t tx_read;
  uint16_t tx_write;
  uint16_t rx_read;
  uint16_t rx_write;
  uint16_t tx_inflight;
  uint8_t tx_retry_count;
  uint8_t sticky_status;
  bool initialized;
  bool transaction_busy;
  uint8_t transaction_command;
  bool state_pending;
  bool local_rts;
  bool upper_rts;
  bool peer_rts;
  bool peer_rts_known;
  sem_t worker_sem;
  bk7258_mb_uart_callback_t callback;
  void *callback_arg;
  struct mb_uart_stats stats;
};

static struct mb_uart_control g_uart;

/* The frame bk7258_mbox_uart_drain_polled() submits, and its sequence
 * counter.  A file static rather than a local because the peer reads the
 * message out of this memory after the call that queued it has returned --
 * the same reason the transport's own slots are statics.  Aligned to 32 to
 * match them.
 */

static struct bk7258_mb_wire_message g_polled_message
  __attribute__((aligned(32)));
static uint8_t g_polled_seq;

/* Set once, by bk7258_mbox_uart_crash_mode(), and never cleared. */

static volatile bool g_crash_mode;

static_assert(MB_UART_TX_SIZE > BK7258_MB_UART_CHUNK_SIZE &&
               MB_UART_TX_SIZE <= UINT16_MAX,
               "mailbox UART TX ring index does not fit uint16_t");
static_assert(MB_UART_RX_SIZE > BK7258_MB_UART_CHUNK_SIZE &&
               MB_UART_RX_SIZE <= UINT16_MAX,
               "mailbox UART RX ring index does not fit uint16_t");

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static uint16_t ring_count(uint16_t read_index, uint16_t write_index,
                           uint16_t size)
{
  return write_index >= read_index ? write_index - read_index :
         size - read_index + write_index;
}

static uint16_t tx_count(void)
{
  return ring_count(g_uart.tx_read, g_uart.tx_write, MB_UART_TX_SIZE);
}

static uint16_t rx_count(void)
{
  return ring_count(g_uart.rx_read, g_uart.rx_write, MB_UART_RX_SIZE);
}

static uint16_t tx_free(void)
{
  return MB_UART_TX_SIZE - tx_count() - 1u;
}

static uint16_t rx_free(void)
{
  return MB_UART_RX_CAPACITY - rx_count();
}

static void update_local_rts(void)
{
  bool new_rts = g_uart.upper_rts || rx_free() <= MB_UART_RTS_ASSERT;

  if (new_rts != g_uart.local_rts)
    {
      g_uart.local_rts = new_rts;
      g_uart.state_pending = true;
      if (new_rts)
        {
          g_uart.stats.rts_assert++;
        }
      else
        {
          g_uart.stats.rts_release++;
        }
    }
}

static bool valid_ack(const struct bk7258_mb_wire_message *ack)
{
  /* Armino's mb_uart response defines only the low byte of ack_data1:
   * uart_rts and uart_tx_fail.  The remaining bytes are remnants of the
   * command buffer and are not initialized by the CP response handler.
   * Header matching and the transport state checks already validate the
   * response ownership, so do not interpret those bytes as a wire ACK shape.
   */

  return ack != NULL;
}

static void mb_uart_tx_complete(const struct bk7258_mb_wire_message *ack,
                                int result, void *arg)
{
  uint8_t command;
  bool failed;

  (void)arg;
  /* The mailbox transport invokes completion callbacks with interrupts
   * disabled, so this callback updates UART state directly.
   */

  command = ack == NULL ? g_uart.transaction_command :
            bk7258_mb_header_cmd(ack);
  failed = result < 0 || !valid_ack(ack) ||
           (ack != NULL && (ack->payload_address & 2u) != 0);

  if (ack != NULL && valid_ack(ack))
    {
      g_uart.peer_rts = (ack->payload_address & 1u) != 0;
      g_uart.peer_rts_known = true;
    }

