open-vela/nuttx/arch/arm/src/bk7258/bk7258_mb_uart.c
  if (result == -ETIMEDOUT || result == -ECONNRESET)
    {
      g_uart.peer_rts_known = false;
      g_uart.state_pending = true;
    }

  if (command == BK7258_MB_UART_DATA && g_uart.tx_inflight != 0)
    {
      if (!failed)
        {
          g_uart.tx_read = (g_uart.tx_read + g_uart.tx_inflight) %
                           MB_UART_TX_SIZE;
          g_uart.tx_retry_count = 0;
        }
      else if (result == -ETIMEDOUT || result == -ECONNRESET)
        {
          /* A failed/unknown ACK cannot tell whether CP consumed the bytes.
           * Drop this local chunk rather than replaying terminal characters.
           */

          g_uart.tx_read = (g_uart.tx_read + g_uart.tx_inflight) %
                           MB_UART_TX_SIZE;
          g_uart.stats.tx_unknown++;
          g_uart.tx_retry_count = 0;
          g_uart.stats.resets++;
        }
      else
        {
          g_uart.stats.remote_fail++;
          g_uart.state_pending = true;
          if (g_uart.tx_retry_count == 0)
            {
              /* Keep tx_read unchanged.  The same chunk may be copied again
               * once STATE recovery succeeds, but only once.
               */

              g_uart.tx_retry_count = 1;
              g_uart.stats.tx_retry++;
            }
          else
            {
              g_uart.tx_read = (g_uart.tx_read + g_uart.tx_inflight) %
                               MB_UART_TX_SIZE;
              g_uart.tx_retry_count = 0;
              g_uart.stats.tx_retry_drop++;
            }
        }

      g_uart.tx_inflight = 0;
    }
  else if (command == BK7258_MB_UART_STATE && failed)
    {
      g_uart.stats.remote_fail++;
      /* The transport invokes this completion before it changes READY to
       * ABORTING.  Always retain a STATE request so RESET recovery has a
       * probe to send after it reaches PROBING.
       */

      g_uart.state_pending = true;
    }

  g_uart.transaction_busy = false;
  nxsem_post(&g_uart.worker_sem);
}

static int mb_uart_receive(const struct bk7258_mb_wire_message *message,
                           uint8_t *ack_flags, void *arg)
{
  uint8_t command = bk7258_mb_header_cmd(message);
  uint16_t length = message->payload_length;
  uint16_t first;
  bool failed = false;
  bool malformed = false;

  (void)arg;
  if (ack_flags == NULL)
    {
      return -EINVAL;
    }

  if (command != BK7258_MB_UART_DATA && command != BK7258_MB_UART_STATE)
    {
      g_uart.stats.bad_flags++;
      failed = true;
      malformed = true;
    }
  else if ((message->flags & ~1u) != 0)
    {
      g_uart.stats.bad_flags++;
      failed = true;
      malformed = true;
    }
  else if (message->crc8 != 0)
    {
      g_uart.stats.bad_crc++;
      g_uart.sticky_status |= MB_UART_STATUS_PARITY;
      failed = true;
      malformed = true;
    }

  /* The CP command occupies only the first 12 bytes of the 16-byte mailbox
   * slot.  Bytes 12..15 are not part of mb_uart_cmd_t and may be stale.
   */

  if (!failed && command == BK7258_MB_UART_DATA)
    {
      if (message->payload_address != BK7258_MB_UART_RX_ADDRESS)
        {
          g_uart.stats.bad_pointer++;
          failed = true;
          malformed = true;
        }
      else if (length == 0 || length > BK7258_MB_UART_CHUNK_SIZE)
        {
          g_uart.stats.bad_length++;
          failed = true;
          malformed = true;
        }
      else if (!bk7258_mailbox_link_ready())
        {
          failed = true;
        }
      else if (rx_free() < length)
        {
          g_uart.stats.rx_overflow++;
          g_uart.sticky_status |= MB_UART_STATUS_OVF;
          failed = true;
        }
      else
        {
          const uint8_t *source =
            (const uint8_t *)(uintptr_t)BK7258_MB_UART_RX_ADDRESS;

          __asm__ volatile("dmb sy" ::: "memory");
          first = MB_UART_RX_SIZE - g_uart.rx_write;
          if (first > length)
            {
              first = length;
            }

          memcpy(&g_uart.rx_ring[g_uart.rx_write], source, first);
          if (first != length)
            {
              memcpy(g_uart.rx_ring, source + first, length - first);
            }

          g_uart.rx_write = (g_uart.rx_write + length) % MB_UART_RX_SIZE;
          g_uart.stats.data_rx++;
          g_uart.stats.rx_bytes += length;
        }
    }
  else if (!failed)
    {
      if (message->payload_address != 0 || message->payload_length != 0)
        {
          g_uart.stats.bad_length++;
          failed = true;
          malformed = true;
        }
      else
        {
          g_uart.stats.state_rx++;
        }
    }

  if (!malformed)
    {
      bool old_peer_rts = g_uart.peer_rts;

      g_uart.peer_rts = (message->flags & 1u) != 0;
      g_uart.peer_rts_known = true;
      if (old_peer_rts && !g_uart.peer_rts)
        {
          nxsem_post(&g_uart.worker_sem);
        }
    }

  update_local_rts();
  *ack_flags = (g_uart.local_rts ? 1u : 0u) | (failed ? 2u : 0u);
  nxsem_post(&g_uart.worker_sem);
  return malformed ? -EPROTO : OK;
}

static int send_state_locked(void)
{
  struct bk7258_mb_wire_message message;
  int ret;

  memset(&message, 0, sizeof(message));
  message.header = bk7258_mb_make_header(BK7258_MB_UART_STATE, 0, 0, 0,
                                         BK7258_MB_CHAN_UART0_TX);
  message.flags = g_uart.local_rts ? 1u : 0u;
  ret = bk7258_mailbox_send_wire(BK7258_MB_CHAN_UART0_TX, &message,
                                  mb_uart_tx_complete, NULL);
  if (ret == OK)
    {
      g_uart.transaction_busy = true;
      g_uart.transaction_command = BK7258_MB_UART_STATE;
      g_uart.state_pending = false;
      g_uart.stats.state_tx++;
    }

  return ret;
}

static int send_data_locked(void)
{
  struct bk7258_mb_wire_message message;
  uint8_t *destination =
    (uint8_t *)(uintptr_t)BK7258_MB_UART_TX_ADDRESS;
  uint16_t length = tx_count();
  uint16_t first;
  int ret;

  if (length > BK7258_MB_UART_CHUNK_SIZE)
    {
      length = BK7258_MB_UART_CHUNK_SIZE;
    }

  if (length == 0 || g_uart.peer_rts)
    {
      return -EAGAIN;
    }

  first = MB_UART_TX_SIZE - g_uart.tx_read;
  if (first > length)
    {
      first = length;
    }

  memcpy(destination, &g_uart.tx_ring[g_uart.tx_read], first);
  if (first != length)
    {
      memcpy(destination + first, g_uart.tx_ring, length - first);
    }

