open-vela/nuttx/arch/arm/src/bk7258/bk7258_mb_uart.c
  memset(&message, 0, sizeof(message));
  message.header = bk7258_mb_make_header(BK7258_MB_UART_DATA, 0, 0, 0,
                                         BK7258_MB_CHAN_UART0_TX);
  message.payload_address = BK7258_MB_UART_TX_ADDRESS;
  message.payload_length = length;
  message.flags = g_uart.local_rts ? 1u : 0u;
  __asm__ volatile("dmb sy" ::: "memory");
  ret = bk7258_mailbox_send_wire(BK7258_MB_CHAN_UART0_TX, &message,
                                  mb_uart_tx_complete, NULL);
  if (ret == OK)
    {
      g_uart.transaction_busy = true;
      g_uart.transaction_command = BK7258_MB_UART_DATA;
      g_uart.tx_inflight = length;
      g_uart.stats.data_tx++;
    }

  return ret;
}

static int mb_uart_worker(int argc, char **argv)
{
  (void)argc;
  (void)argv;

  for (; ; )
    {
      bk7258_mb_uart_callback_t callback;
      void *callback_arg;
      irqstate_t flags;
      enum bk7258_mb_link_state link;

      (void)nxsem_tickwait_uninterruptible(&g_uart.worker_sem,
                                           MB_UART_WORK_INTERVAL);
      nxsem_reset(&g_uart.worker_sem, 0);
      link = bk7258_mailbox_link_state();
      flags = up_irq_save();

      if (!g_uart.transaction_busy)
        {
          if (link == BK7258_MB_LINK_PROBING && g_uart.state_pending)
            {
              (void)send_state_locked();
            }
          else if (link == BK7258_MB_LINK_READY)
            {
              if (g_uart.state_pending)
                {
                  (void)send_state_locked();
                }
              else
                {
                  (void)send_data_locked();
                }
            }
        }

      callback = g_uart.callback;
      callback_arg = g_uart.callback_arg;
      up_irq_restore(flags);

      if (callback != NULL)
        {
          callback(callback_arg);
        }
    }

  return OK;
}

void bk7258_mbox_uart_early_init(void)
{
  /* The zero-initialized TX ring accepts bounded early logs before MBOX0 is
   * available.  Full rings return an accurate short write.
   */
}

int bk7258_mb_uart_init(void)
{
  int ret;

  if (g_uart.initialized)
    {
      return OK;
    }

  /* Keep early TX data and its indices. */

  g_uart.rx_read = 0;
  g_uart.rx_write = 0;
  g_uart.tx_inflight = 0;
  g_uart.tx_retry_count = 0;
  g_uart.sticky_status = 0;
  g_uart.transaction_busy = false;
  g_uart.transaction_command = BK7258_MB_UART_STATE;
  g_uart.state_pending = true;
  g_uart.local_rts = false;
  g_uart.upper_rts = false;
  g_uart.peer_rts = false;
  g_uart.peer_rts_known = false;
  memset(&g_uart.stats, 0, sizeof(g_uart.stats));
  nxsem_init(&g_uart.worker_sem, 0, 0);

  ret = bk7258_mailbox_register_rx(BK7258_MB_CHAN_UART0_RX,
                                    mb_uart_receive, NULL);
  if (ret < 0)
    {
      return ret;
    }

  ret = kthread_create("mb-uart0", MB_UART_PRIORITY, 2048,
                       mb_uart_worker, NULL);
  if (ret < 0)
    {
      return ret;
    }

  g_uart.initialized = true;
  return OK;
}

void bk7258_mb_uart_start(void)
{
  irqstate_t flags;

  if (!g_uart.initialized)
    {
      return;
    }

  flags = up_irq_save();
  g_uart.state_pending = true;
  up_irq_restore(flags);
  (void)bk7258_mailbox_start_probe();
  nxsem_post(&g_uart.worker_sem);
}

void bk7258_mb_uart_request_state(void)
{
  irqstate_t flags;

  if (!g_uart.initialized)
    {
      return;
    }

  flags = up_irq_save();
  g_uart.state_pending = true;
  up_irq_restore(flags);
  nxsem_post(&g_uart.worker_sem);
}

ssize_t bk7258_mbox_uart_write(const uint8_t *data, size_t length)
{
  irqstate_t flags;
  uint16_t available;
  uint16_t written;
  uint16_t first;

  if (data == NULL && length != 0)
    {
      return -EINVAL;
    }

  if (length == 0)
    {
      return 0;
    }

  flags = up_irq_save();
  available = tx_free();
  written = length > available ? available : length;
  first = MB_UART_TX_SIZE - g_uart.tx_write;
  if (first > written)
    {
      first = written;
    }

  memcpy(&g_uart.tx_ring[g_uart.tx_write], data, first);
  if (first != written)
    {
      memcpy(g_uart.tx_ring, data + first, written - first);
    }

  g_uart.tx_write = (g_uart.tx_write + written) % MB_UART_TX_SIZE;
  g_uart.stats.write_calls++;
  g_uart.stats.write_bytes += written;
  if (written < length)
    {
      g_uart.stats.short_writes++;
    }

  up_irq_restore(flags);
  if (g_uart.initialized && written != 0)
    {
      nxsem_post(&g_uart.worker_sem);
    }

  return written;
}

ssize_t bk7258_mbox_uart_read(uint8_t *data, size_t length,
                              unsigned int *status)
{
  irqstate_t flags;
  uint16_t available;
  uint16_t count;
  uint16_t first;

  if (data == NULL || length == 0)
    {
      return -EINVAL;
    }

  flags = up_irq_save();
  available = rx_count();
  count = length > available ? available : length;
  first = MB_UART_RX_SIZE - g_uart.rx_read;
  if (first > count)
    {
      first = count;
    }

  memcpy(data, &g_uart.rx_ring[g_uart.rx_read], first);
  if (first != count)
    {
      memcpy(data + first, g_uart.rx_ring, count - first);
    }

  g_uart.rx_read = (g_uart.rx_read + count) % MB_UART_RX_SIZE;
  if (status != NULL)
    {
      *status = g_uart.sticky_status;
      g_uart.sticky_status = 0;
    }

  if (!g_uart.upper_rts && g_uart.local_rts &&
      rx_count() < MB_UART_RTS_RELEASE)
    {
      update_local_rts();
    }

  up_irq_restore(flags);
  if (g_uart.initialized && count != 0)
    {
      nxsem_post(&g_uart.worker_sem);
    }

  return count;
}

bool bk7258_mbox_uart_rxavailable(void)
{
  irqstate_t flags = up_irq_save();
  bool available = rx_count() != 0;
  up_irq_restore(flags);
  return available;
}

bool bk7258_mbox_uart_txready(void)
{
  bool link_ready = bk7258_mailbox_link_ready();
  irqstate_t flags = up_irq_save();
  bool ready = g_uart.initialized && link_ready && tx_free() != 0;
  up_irq_restore(flags);
  return ready;
}

bool bk7258_mbox_uart_txempty(void)
{
  irqstate_t flags = up_irq_save();
  bool empty = tx_count() == 0 && g_uart.tx_inflight == 0 &&
               !g_uart.transaction_busy;
  up_irq_restore(flags);
  return empty;
}

void bk7258_mbox_uart_rxflowcontrol(bool upper)
{
  irqstate_t flags = up_irq_save();

  g_uart.upper_rts = upper;
  update_local_rts();
  up_irq_restore(flags);
  if (g_uart.initialized)
    {
      nxsem_post(&g_uart.worker_sem);
    }
}

void bk7258_mbox_uart_set_callback(bk7258_mb_uart_callback_t callback,
                                   void *arg)
{
  irqstate_t flags = up_irq_save();

  g_uart.callback = callback;
  g_uart.callback_arg = arg;
  up_irq_restore(flags);
}

/****************************************************************************
 * Name: bk7258_mbox_uart_drain_polled
 *
 * Description:
 *   Push whatever is in the TX ring straight at the mailbox hardware, using
 *   nothing but register writes and bounded spins.
 *
 *   This exists because the ordinary path cannot report a crash.  Console
 *   bytes reach the CP only when mb_uart_worker() moves them, and that is a
 *   kthread woken by a semaphore: it needs interrupts and a scheduler.  An
 *   assertion has neither -- a stack-limit violation arrives as a HardFault,
 *   so _assert() runs in exception context with interrupts off -- and
 *   bk7258_mbox_uart_flush() cannot help either, because it waits by calling
 *   nxsig_usleep().  So the register dump and stack trace were written into
 *   the ring and left there, and the only evidence an assertion had happened
 *   at all was the red LED plus the CP resetting the part eight seconds
 *   later
 *   for a missing heartbeat.  Three separate faults were diagnosed by
 *   inference from timestamps because of this.
 *
 *   The CP is alive and printing throughout that window, and eight seconds
 *   is
 *   an enormous budget for a few kilobytes, so there is nothing wrong with
 *   the
 *   transport -- only with needing a scheduler to use it.
 *
 *   Deliberately best-effort, and the compromises are worth naming:
 *
 *   - No ACK is read, so tx_read advances on submission rather than on
 *     completion, and the staging area is reused after a fixed settle spin
 *     instead of after the CP confirms it copied the payload.  A chunk can
 *     therefore be lost or torn.  Losing some of a dump beats losing all of
 *     it, which is what happens today.
 *   - Peer RTS is ignored.  Flow control protects a running system from
 *     overrunning the CP's log queue; a system that is about to be reset has
 *     no later output to protect.
 *   - It reuses BK7258_MB_UART_TX_ADDRESS, so it will corrupt a normal
 *     UART_DATA transaction that was in flight.  That transaction's ACK is
 *     never coming.
 *
 *   Safe to call from interrupt context and with interrupts already
 *   disabled;
 *   it does not block, allocate or print.
 *
 ****************************************************************************/

void bk7258_mbox_uart_crash_mode(void)
{
  g_crash_mode = true;
}

void bk7258_mbox_uart_drain_polled(void)
{
  FAR uint8_t *destination =
    (FAR uint8_t *)(uintptr_t)BK7258_MB_UART_TX_ADDRESS;
  unsigned int chunk;

  /* The gate, and the reason it is here rather than at the call site.
   *
   * Everything below bypasses the transport: it stamps its own sequence
   * numbers, does not wait for acknowledgements, ignores the peer's flow
   * control and reuses the staging buffer a live transaction may still own.
   * Those are all defensible once nothing is going to run again, and all
   * corrupting when something is.
   *
   * Measured 2026-08-31: hooked into every interrupt-context syslog rather
   * than into crash paths only, this moved the CP's console link-down during
   * social mode from 1.75 s after the camera opened to 378 ms.  The hook was
   * too broad, and putting the check at that one call site would have left
   * the
   * next caller free to make the same mistake.  Enforcing it here means the
   * only way to arm this is to declare a crash.
   */

