open-vela/nuttx/arch/arm/src/bk7258/bk7258_mb_uart.c
  if (!g_crash_mode || !g_uart.initialized)
    {
      return;
    }

  for (chunk = 0; chunk < MB_UART_POLLED_CHUNKS; chunk++)
    {
      irqstate_t flags;
      uint32_t wire[2];
      uint16_t length;
      uint16_t first;
      unsigned int spin;
      int ret = -EAGAIN;

      flags = up_irq_save();

      length = tx_count();
      if (length == 0)
        {
          up_irq_restore(flags);
          return;
        }

      if (length > BK7258_MB_UART_CHUNK_SIZE)
        {
          length = BK7258_MB_UART_CHUNK_SIZE;
        }

      first = MB_UART_TX_SIZE - g_uart.tx_read;
      if (first > length)
        {
          first = length;
        }

      memcpy(destination, &g_uart.tx_ring[g_uart.tx_read], first);
      if (first != length)
        {
          memcpy(destination + first, g_uart.tx_ring, length - first);
        }

      /* A fresh sequence number per chunk, for the same reason the transport
       * stamps one: consecutive frames that carry the same one look like a
       * retransmission to the peer.
       */

      memset(&g_polled_message, 0, sizeof(g_polled_message));
      g_polled_message.header =
        bk7258_mb_make_header(BK7258_MB_UART_DATA, 0, 0, ++g_polled_seq,
                              BK7258_MB_CHAN_UART0_TX);
      g_polled_message.payload_address = BK7258_MB_UART_TX_ADDRESS;
      g_polled_message.payload_length = length;

      wire[0] = (uint32_t)(uintptr_t)&g_polled_message;
      wire[1] = sizeof(g_polled_message);

      __asm__ volatile("dmb sy" ::: "memory");

      /* -EAGAIN is the peer's receive FIFO being full, which is transient
       * and
       * the one failure worth waiting out.  Anything else means the hardware
       * will not take this frame however long we spin.
       */

      for (spin = 0; spin < MB_UART_POLLED_FIFO_SPINS; spin++)
        {
          ret = bk7258_mbox_send(0, wire);
          if (ret != -EAGAIN)
            {
              break;
            }
        }

      if (ret < 0)
        {
          up_irq_restore(flags);
          return;
        }

      g_uart.tx_read = (g_uart.tx_read + length) % MB_UART_TX_SIZE;
      g_uart.stats.data_tx++;
      length = tx_count();
      up_irq_restore(flags);

      if (length == 0)
        {
          return;
        }

      /* Only between chunks, never after the last one.  The wait is to stop
       * the next chunk overwriting a payload the CP has not copied yet, so
       * with no next chunk there is nothing to wait for -- and this function
       * is called once per line during a dump, so paying it on every call
       * would be most of the cost for none of the benefit.
       *
       * The CP's receive handler takes microseconds; this is slack rather
       * than
       * a measured requirement.
       */

      for (spin = 0; spin < MB_UART_POLLED_SETTLE_SPINS; spin++)
        {
          __asm__ volatile("nop");
        }
    }
}

int bk7258_mbox_uart_flush(unsigned int timeout_ms)
{
  clock_t deadline = clock_systime_ticks() + MSEC2TICK(timeout_ms);

  if (!g_uart.initialized || !bk7258_mailbox_link_ready())
    {
      return -EAGAIN;
    }

  while (!bk7258_mbox_uart_txempty())
    {
      if ((int32_t)(clock_systime_ticks() - deadline) >= 0)
        {
          return -ETIMEDOUT;
        }

      nxsig_usleep(1000);
    }

  return OK;
}

void bk7258_mbox_uart_dump_stats(void)
{
  irqstate_t flags;
  struct mb_uart_stats stats;
  uint16_t tx;
  uint16_t rx;
  bool local_rts;
  bool peer_rts;

  flags = up_irq_save();
  stats = g_uart.stats;
  tx = tx_count();
  rx = rx_count();
  local_rts = g_uart.local_rts;
  peer_rts = g_uart.peer_rts;
  up_irq_restore(flags);

  printf("mb-uart0: txq=%u rxq=%u rts=%u cts=%u data=%lu/%lu "
         "state=%lu/%lu short=%lu overflow=%lu bad=%lu/%lu/%lu/%lu/%lu "
         "remote=%lu retry=%lu/%lu unknown=%lu reset=%lu\n",
         tx, rx, local_rts, peer_rts,
         (unsigned long)stats.data_tx, (unsigned long)stats.data_rx,
         (unsigned long)stats.state_tx, (unsigned long)stats.state_rx,
         (unsigned long)stats.short_writes,
         (unsigned long)stats.rx_overflow,
         (unsigned long)stats.bad_pointer,
         (unsigned long)stats.bad_length,
         (unsigned long)stats.bad_flags,
         (unsigned long)stats.bad_crc,
         (unsigned long)stats.bad_reserved,
         (unsigned long)stats.remote_fail,
         (unsigned long)stats.tx_retry,
         (unsigned long)stats.tx_retry_drop,
         (unsigned long)stats.tx_unknown,
         (unsigned long)stats.resets);
}
